# name:shen
# time:2023/3/15
# content:

# 数据准备

In [2]:
import pandas as pd

In [3]:
df = pd.read_csv('./data/learn_pandas.csv')

In [4]:
df

,School,Grade,Name,Gender,Height,Weight,Transfer,Test_Number,Test_Date,Time_Record
0,Shanghai Jiao Tong University,Freshman,Gaopeng Yang,Female,158.9,46.0,N,1,2019/10/5,0:04:34
1,Peking University,Freshman,Changqiang You,Male,166.5,70.0,N,1,2019/9/4,0:04:20
2,Shanghai Jiao Tong University,Senior,Mei Sun,Male,188.9,89.0,N,2,2019/9/12,0:05:22
3,Fudan University,Sophomore,Xiaojuan Sun,Female,NaN,41.0,N,2,2020/1/3,0:04:08
4,Fudan University,Sophomore,Gaojuan You,Male,174.0,74.0,N,2,2019/11/6,0:05:22
...,...,...,...,...,...,...,...,...,...,...
195,Fudan University,Junior,Xiaojuan Sun,Female,153.9,46.0,N,2,2019/10/17,0:04:31
196,Tsinghua University,Senior,Li Zhao,Female,160.9,50.0,N,3,2019/9/22,0:04:03
197,Shanghai Jiao Tong University,Senior,Chengqiang Chu,Female,153.9,45.0,N,1,2020/1/5,0:04:48
198,Shanghai Jiao Tong University,Senior,Chengmei Shen,Male,175.3,71.0,N,2,2020/1/7,0:04:58
199,Tsinghua University,Sophomore,Chunpeng Lv,Male,155.7,51.0,N,1,2019/11/6,0:05:05

In [5]:
df.head()

,School,Grade,Name,Gender,Height,Weight,Transfer,Test_Number,Test_Date,Time_Record
0,Shanghai Jiao Tong University,Freshman,Gaopeng Yang,Female,158.9,46.0,N,1,2019/10/5,0:04:34
1,Peking University,Freshman,Changqiang You,Male,166.5,70.0,N,1,2019/9/4,0:04:20
2,Shanghai Jiao Tong University,Senior,Mei Sun,Male,188.9,89.0,N,2,2019/9/12,0:05:22
3,Fudan University,Sophomore,Xiaojuan Sun,Female,NaN,41.0,N,2,2020/1/3,0:04:08
4,Fudan University,Sophomore,Gaojuan You,Male,174.0,74.0,N,2,2019/11/6,0:05:22

In [6]:
df.tail()

,School,Grade,Name,Gender,Height,Weight,Transfer,Test_Number,Test_Date,Time_Record
195,Fudan University,Junior,Xiaojuan Sun,Female,153.9,46.0,N,2,2019/10/17,0:04:31
196,Tsinghua University,Senior,Li Zhao,Female,160.9,50.0,N,3,2019/9/22,0:04:03
197,Shanghai Jiao Tong University,Senior,Chengqiang Chu,Female,153.9,45.0,N,1,2020/1/5,0:04:48
198,Shanghai Jiao Tong University,Senior,Chengmei Shen,Male,175.3,71.0,N,2,2020/1/7,0:04:58
199,Tsinghua University,Sophomore,Chunpeng Lv,Male,155.7,51.0,N,1,2019/11/6,0:05:05

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   School       200 non-null    object
 1   Grade        200 non-null    object
 2   Name         200 non-null    object
 3   Gender       200 non-null    object
 4   Height       183 non-null    float64
 5   Weight       189 non-null    float64
 6   Transfer     188 non-null    object
 7   Test_Number  200 non-null    int64
 8   Test_Date    200 non-null    object
 9   Time_Record  200 non-null    object
dtypes: float64(2), int64(1), object(7)
memory usage: 15.8+ KB

In [10]:
* 计算有多少所学校？

SyntaxError: invalid character '？' (U+FF1F) (1614650477.py, line 1)

In [19]:
index_school = df['School'].nunique()

In [22]:
index_school

4

In [24]:
aa = df['Name'].nunique()

In [25]:
aa

170

In [26]:
maxx = df['Height'].max()

In [27]:
maxx

193.9

In [29]:
minn = df['Height'].min()

In [30]:
minn

145.4

In [30]:
h

In [21]:
# 不同学校数量
df['School'].value_counts()

Tsinghua University              69
Shanghai Jiao Tong University    57
Fudan University                 40
Peking University                34
Name: School, dtype: int64

In [33]:
hurun_独角兽 = pd.read_html('https://www.hurun.net/zh-CN/Info/Detail?num=L9SQPH9FKJB1')[-3]

In [34]:
hurun_独角兽

      0     1                    2          3            4   5      6     7
0    排名  排名变化                 企业名称  价值（亿元人民币）  价值变化（亿元人民币）  国家     城市    行业
1     1     0                   抖音      13400       -10050  中国     北京  社交媒体
2     2     1               SpaceX       8400         1680  美国    洛杉矶    航天
3     3    -1                 蚂蚁集团       8000        -2010  中国     杭州  金融科技
4     4     0               Stripe       4100        -2210  美国    旧金山  金融科技
..   ..   ...                  ...        ...          ...  ..    ...   ...
97   95   -16        Impossible 食品        470            0  美国  雷德伍德城  食品饮料
98   95   -16                   微医        470            0  中国     杭州  健康科技
99   99    58                 蜂巢能源        460          190  中国     常州   新能源
100  99    -6           Better.com        460           60  美国     纽约  金融科技
101  99   -20  Automation Anywhere        460          -10  美国    圣何塞  人工智能

[102 rows x 8 columns]

In [35]:
hurun_独角兽[0:1].values.tolist()[0]

['排名', '排名变化', '企业名称', '价值（亿元人民币）', '价值变化（亿元人民币）', '国家', '城市', '行业']

In [36]:
* columns的重新命名:rename

SyntaxError: invalid syntax (954660797.py, line 1)

In [56]:
df_hurun = hurun_独角兽[1:]
df_hurun

      0    1                    2      3       4   5      6     7
1     1    0                   抖音  13400  -10050  中国     北京  社交媒体
2     2    1               SpaceX   8400    1680  美国    洛杉矶    航天
3     3   -1                 蚂蚁集团   8000   -2010  中国     杭州  金融科技
4     4    0               Stripe   4100   -2210  美国    旧金山  金融科技
5     5   11                Shein   4000    2680  中国     广州  电子商务
..   ..  ...                  ...    ...     ...  ..    ...   ...
97   95  -16        Impossible 食品    470       0  美国  雷德伍德城  食品饮料
98   95  -16                   微医    470       0  中国     杭州  健康科技
99   99   58                 蜂巢能源    460     190  中国     常州   新能源
100  99   -6           Better.com    460      60  美国     纽约  金融科技
101  99  -20  Automation Anywhere    460     -10  美国    圣何塞  人工智能

[101 rows x 8 columns]

In [57]:
df_hurun.columns = hurun_独角兽[0:1].values.tolist()[0]
df_hurun

     排名 排名变化                 企业名称 价值（亿元人民币） 价值变化（亿元人民币）  国家     城市    行业
1     1    0                   抖音     13400      -10050  中国     北京  社交媒体
2     2    1               SpaceX      8400        1680  美国    洛杉矶    航天
3     3   -1                 蚂蚁集团      8000       -2010  中国     杭州  金融科技
4     4    0               Stripe      4100       -2210  美国    旧金山  金融科技
5     5   11                Shein      4000        2680  中国     广州  电子商务
..   ..  ...                  ...       ...         ...  ..    ...   ...
97   95  -16        Impossible 食品       470           0  美国  雷德伍德城  食品饮料
98   95  -16                   微医       470           0  中国     杭州  健康科技
99   99   58                 蜂巢能源       460         190  中国     常州   新能源
100  99   -6           Better.com       460          60  美国     纽约  金融科技
101  99  -20  Automation Anywhere       460         -10  美国    圣何塞  人工智能

[101 rows x 8 columns]

In [58]:
# 有多少个国家
df_hurun['国家']
df_hurun['国家'].value_counts()

美国       49
中国       26
英国        7
印度        4
瑞典        2
印度尼西亚     2
韩国        2
马耳他       1
澳大利亚      1
巴哈马       1
土耳其       1
墨西哥       1
瑞士        1
德国        1
越南        1
以色列       1
Name: 国家, dtype: int64

In [59]:
# 有多少个城市？数量如何在地图上用颜色的深浅表示出来？

In [60]:
# 有多少个行业？
df_hurun['行业'].value_counts()

金融科技     17
软件服务     14
区块链       9
电子商务      8
人工智能      6
物流        5
共享经济      4
新能源       4
快递        4
健康科技      4
网络安全      3
社交媒体      2
游戏        2
生物科技      2
食品饮料      2
企业服务      2
机器人       2
新能源汽车     2
大数据       2
航天        1
教育科技      1
保险        1
新零售       1
数字科技      1
分析        1
消费品       1
Name: 行业, dtype: int64

In [61]:
df_hurun['行业'].nunique()

26

In [62]:
df_hurun['价值（亿元人民币）'].max()

'965'

In [63]:
df_hurun['价值（亿元人民币）'].min()

'1000'

In [64]:
df_hurun['价值（亿元人民币）'].mean()

inf

# Groupby

In [68]:
df.groupby('School').agg({'Height':'mean','Weight':'mean'})

                                   Height     Weight
School
Fudan University               162.408824  54.000000
Peking University              162.977419  55.666667
Shanghai Jiao Tong University  163.932727  56.442308
Tsinghua University            163.149206  54.223881

In [69]:
df.groupby(['School','Gender']).agg({'Height':'mean','Weight':'mean'})

                                          Height     Weight
School                        Gender
Fudan University              Female  158.776923  47.900000
                              Male    174.212500  72.300000
Peking University             Female  158.666667  46.650000
                              Male    172.030000  73.700000
Shanghai Jiao Tong University Female  159.122500  48.513514
                              Male    176.760000  76.000000
Tsinghua University           Female  159.753333  48.000000
                              Male    171.638889  69.947368

In [72]:
df_hurun['价值（亿元人民币）'].astype('int64')

1      13400
2       8400
3       8000
4       4100
5       4000
       ...
97       470
98       470
99       460
100      460
101      460
Name: 价值（亿元人民币）, Length: 101, dtype: int64

In [73]:
df_hurun

     排名 排名变化                 企业名称 价值（亿元人民币） 价值变化（亿元人民币）  国家     城市    行业
1     1    0                   抖音     13400      -10050  中国     北京  社交媒体
2     2    1               SpaceX      8400        1680  美国    洛杉矶    航天
3     3   -1                 蚂蚁集团      8000       -2010  中国     杭州  金融科技
4     4    0               Stripe      4100       -2210  美国    旧金山  金融科技
5     5   11                Shein      4000        2680  中国     广州  电子商务
..   ..  ...                  ...       ...         ...  ..    ...   ...
97   95  -16        Impossible 食品       470           0  美国  雷德伍德城  食品饮料
98   95  -16                   微医       470           0  中国     杭州  健康科技
99   99   58                 蜂巢能源       460         190  中国     常州   新能源
100  99   -6           Better.com       460          60  美国     纽约  金融科技
101  99  -20  Automation Anywhere       460         -10  美国    圣何塞  人工智能

[101 rows x 8 columns]

In [74]:
df_hurun.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 101 entries, 1 to 101
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   排名           101 non-null    object
 1   排名变化         101 non-null    object
 2   企业名称         101 non-null    object
 3   价值（亿元人民币）    101 non-null    object
 4   价值变化（亿元人民币）  101 non-null    object
 5   国家           101 non-null    object
 6   城市           101 non-null    object
 7   行业           101 non-null    object
dtypes: object(8)
memory usage: 6.4+ KB